{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "name": "merge_1", "output_mask": null, "concat_axis": -1, "output_mask_type": "raw", "mode": "concat", "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "activity_regularizer": null, "output_dim": 300, "input_length": 100, "embeddings_constraint": null, "name": "embedding_1", "batch_input_shape": [null, 100], "trainable": true, "input_dim": 612, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_regularizer": null}}, {"class_name": "LSTM", "config": {"units": 300, "activity_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "implementation": 1, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "dropout": 0.3, "stateful": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_dropout": 0.2, "unroll": false, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "return_state": false}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "activity_regularizer": null, "output_dim": 300, "input_length": 100, "embeddings_constraint": null, "name": "embedding_2", "batch_input_shape": [null, 100], "trainable": true, "input_dim": 612, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_regularizer": null}}, {"class_name": "LSTM", "config": {"units": 300, "activity_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "implementation": 1, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "dropout": 0.3, "stateful": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_dropout": 0.2, "unroll": false, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "return_state": false}}]}], "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "trainable": true, "scale": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Dense", "config": {"units": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "PReLU", "config": {"alpha_constraint": null, "name": "p_re_lu_1", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "trainable": true, "scale": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Dense", "config": {"units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}]}