{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"class_name": "Merge", "config": {"output_mask_type": "raw", "mode": "concat", "arguments": {}, "mode_type": "raw", "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape": null, "concat_axis": -1, "layers": [{"class_name": "Sequential", "config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false, "output_dim": 300, "embeddings_constraint": null, "input_dim": 612, "input_length": 100, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 100], "name": "embedding_1", "embeddings_regularizer": null, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"recurrent_dropout": 0.2, "kernel_constraint": null, "unit_forget_bias": true, "dropout": 0.3, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "unroll": false, "activity_regularizer": null, "go_backwards": false, "bias_regularizer": null, "units": 300, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "implementation": 1, "return_state": false, "name": "lstm_1", "stateful": false}, "class_name": "LSTM"}]}, {"class_name": "Sequential", "config": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false, "output_dim": 300, "embeddings_constraint": null, "input_dim": 612, "input_length": 100, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 100], "name": "embedding_2", "embeddings_regularizer": null, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"recurrent_dropout": 0.2, "kernel_constraint": null, "unit_forget_bias": true, "dropout": 0.3, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "unroll": false, "activity_regularizer": null, "go_backwards": false, "bias_regularizer": null, "units": 300, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "implementation": 1, "return_state": false, "name": "lstm_2", "stateful": false}, "class_name": "LSTM"}]}]}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "name": "batch_normalization_1", "scale": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 300, "use_bias": true, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_constraint": null, "name": "p_re_lu_1", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.2, "seed": null}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1, "name": "batch_normalization_2", "scale": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 1, "use_bias": true, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}], "class_name": "Sequential"}