{"config": [{"config": {"concat_axis": -1, "output_shape": null, "dot_axes": -1, "arguments": {}, "mode_type": "raw", "output_mask": null, "layers": [{"config": [{"config": {"dtype": "float32", "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1", "input_dim": 612, "output_dim": 300, "activity_regularizer": null, "input_length": 100, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "batch_input_shape": [null, 100], "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"recurrent_constraint": null, "bias_constraint": null, "return_state": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "activation": "tanh", "go_backwards": false, "dropout": 0.3, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "unit_forget_bias": true, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "units": 300, "stateful": false, "activity_regularizer": null, "recurrent_dropout": 0.2, "trainable": true}, "class_name": "LSTM"}], "class_name": "Sequential"}, {"config": [{"config": {"dtype": "float32", "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_2", "input_dim": 612, "output_dim": 300, "activity_regularizer": null, "input_length": 100, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "batch_input_shape": [null, 100], "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"recurrent_constraint": null, "bias_constraint": null, "return_state": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "activation": "tanh", "go_backwards": false, "dropout": 0.3, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "unit_forget_bias": true, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "units": 300, "stateful": false, "activity_regularizer": null, "recurrent_dropout": 0.2, "trainable": true}, "class_name": "LSTM"}], "class_name": "Sequential"}], "output_shape_type": "raw", "name": "merge_1", "mode": "concat", "output_mask_type": "raw"}, "class_name": "Merge"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "center": true, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}